src/OneSBuild/src/InformationRegisters/ВременныеИдентификаторыЗапросов/ВременныеИдентификаторыЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВременныеИдентификаторыЗапросов</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Запрос</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/OneSBuild/src/InformationRegisters/ВременныеИдентификаторыЗапросов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция ЗарегистрироватьЗапрос(Запрос, ТипЗапроса, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	Если ТипЗапроса = Метаданные.HTTPСервисы.ПередачаДанных.ШаблоныURL.ХранилищеИИдентификатор.Методы.POST.ПолноеИмя()
		Или ТипЗапроса = Метаданные.HTTPСервисы.ПередачаДанных.ШаблоныURL.ТомИПутьКФайлу.Методы.POST.ПолноеИмя() Тогда
		Результат = ПередачаДанныхСлужебный.ИмяВременногоФайла(, ДополнительныеПараметры);
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ИмяВременногоФайла = Результат.ИмяВременногоФайла;
		АдресS3 = Результат.АдресS3;
		ИдентификаторФайла = Результат.ИдентификаторФайла;
	Иначе
		ИмяВременногоФайла = Результат;
		АдресS3 = Неопределено;
		ИдентификаторФайла = Неопределено;
	КонецЕсли;
	
	СтруктураЗапроса = Новый Структура;
	
	СтруктураЗапроса.Вставить("HTTPМетод", Запрос.HTTPМетод);
	СтруктураЗапроса.Вставить("БазовыйURL", Запрос.БазовыйURL);
	СтруктураЗапроса.Вставить("Заголовки", ЗаголовкиБезАвторизации(Запрос.Заголовки));
	СтруктураЗапроса.Вставить("ОтносительныйURL", Запрос.ОтносительныйURL);
	СтруктураЗапроса.Вставить("ПараметрыURL", Запрос.ПараметрыURL);
	СтруктураЗапроса.Вставить("ПараметрыЗапроса", Запрос.ПараметрыЗапроса);
	СтруктураЗапроса.Вставить("ИдентификаторЗапроса", Строка(Новый УникальныйИдентификатор));
	СтруктураЗапроса.Вставить("ТипЗапроса", ТипЗапроса);
	СтруктураЗапроса.Вставить("ИмяВременногоФайла", ИмяВременногоФайла);
	СтруктураЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса);
	
	ЗапросJSON = ЗаписьJSON.Закрыть();
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешированиеДанных.Добавить(ЗапросJSON);
	Идентификатор = НРег(СтрЗаменить(Строка(ХешированиеДанных.ХешСумма), " ", ""));
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Идентификатор = Идентификатор;
	МенеджерЗаписи.Дата = ТекущаяУниверсальнаяДата();
	МенеджерЗаписи.Запрос = Новый ХранилищеЗначения(ЗапросJSON);
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи.Записать(Ложь);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Новый Структура("Идентификатор, АдресS3, ИдентификаторФайла", Идентификатор, АдресS3, ИдентификаторФайла);
	
КонецФункции


// Возвращает данные запроса по идентификатору.
// 
// Параметры:
// 	Идентификатор - Строка - идентификатор запроса.
// 	
// Возвращаемое значение:
// 	Структура, Неопределено - исходный запрос:
//   * HTTPМетод - Строка - HTTP-метод. 
//   * БазовыйURL - Строка - базовая часть URL-запроса. 
//   * Заголовки - ФиксированноеСоответствие - заголовки HTTP-запроса. 
//   * ОтносительныйURL - Строка - относительная часть URL-адреса. 
//   * ПараметрыURL - ФиксированноеСоответствие - части URL-адреса, которые были параметризованы в шаблоне.
//   * ПараметрыЗапроса - ФиксированноеСоответствие - параметры запроса.
//   * ИдентификаторЗапроса - Строка - уникальный идентификатор запроса.
//   * ТипЗапроса - Строка - тип запроса. 
//   * ИмяВременногоФайла - Строка - имя временного файла.
//   * ДополнительныеПараметры - Произвольный - дополнительные параметры.
//
Функция ЗапросПоИдентификатору(Идентификатор) Экспорт
	
	Запрос = Неопределено;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = НРег(Идентификатор);
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи.Прочитать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если МенеджерЗаписи.Выбран() Тогда
		
		Если ТекущаяУниверсальнаяДата() - МенеджерЗаписи.Дата < ПередачаДанныхСлужебный.ПериодДействияВременногоИдентификатора() Тогда
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(МенеджерЗаписи.Запрос.Получить());
			Запрос = ПрочитатьJSON(ЧтениеJSON, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Запрос;
		
КонецФункции

Процедура ПродлитьДействиеВременногоИдентификатора(Идентификатор) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = НРег(Идентификатор);
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи.Прочитать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если МенеджерЗаписи.Выбран() Тогда
		
		МенеджерЗаписи.Дата = ТекущаяУниверсальнаяДата();
		
		ПередачаДанныхСлужебный.ПриПродленииДействияВременногоИдентификатора(Идентификатор, МенеджерЗаписи);
		
		УстановитьПривилегированныйРежим(Истина);
		МенеджерЗаписи.Записать(Истина);
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьПросроченныеЗапросы() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Попытка

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СрокХранения", НачалоДня(ТекущаяУниверсальнаяДата()) - 86400 * 7);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 10
		|	ВременныеИдентификаторыЗапросов.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.ВременныеИдентификаторыЗапросов КАК ВременныеИдентификаторыЗапросов
		|ГДЕ
		|	ВременныеИдентификаторыЗапросов.Дата < &СрокХранения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВременныеИдентификаторыЗапросов.Дата";

		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат;
		КонецЕсли;

		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл

			КлючЗаписи = СоздатьКлючЗаписи(Новый Структура("Идентификатор", Выборка.Идентификатор));
			Попытка
				ЗаблокироватьДанныеДляРедактирования(КлючЗаписи);
			Исключение
				Продолжить;
			КонецПопытки;

			МенеджерЗаписи = СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Идентификатор = Выборка.Идентификатор;
			МенеджерЗаписи.Удалить();

		КонецЦикла;

	Исключение

		ЗаписьЖурналаРегистрации(НСтр("ru = 'ПередачаДанных'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ПередачаДанныхКлиентСервер.ПодробныйТекстОшибки(ИнформацияОбОшибке()));

	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаголовкиБезАвторизации(Заголовки)

	Если ТипЗнч(Заголовки) <> Тип("ФиксированноеСоответствие") И ТипЗнч(Заголовки) <> Тип("Соответствие") Тогда
		Возврат Заголовки;
	КонецЕсли;
	
	Результат = Новый Соответствие();
	
	Для Каждого ЭлементКоллекции Из Заголовки Цикл
		
		ИмяЗаголовка = ЭлементКоллекции.Ключ;
		ЗначениеЗаголовка = ЭлементКоллекции.Значение;
		
		Если НРег(ИмяЗаголовка) = "authorization" Тогда
			ЭлементыАвторизации = СтрРазделить(ЗначениеЗаголовка, " ", Ложь);
			Если ЭлементыАвторизации.Количество() > 1 Тогда
				ЗначениеЗаголовка = ЭлементыАвторизации[0] + " ***";
			Иначе
				ЗначениеЗаголовка = "***";
			КонецЕсли;	
		КонецЕсли;
		
		Результат.Вставить(ИмяЗаголовка, ЗначениеЗаголовка);
		
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(Результат);

КонецФункции

#КонецОбласти

#КонецЕсли
